# ===== Core =====
brew "git"
brew "chezmoi"

# ===== Dev =====
brew "lazygit"
brew "lazysql"
brew "difftastic"
brew "ghq"
brew "mise"
brew "gh"

# ===== CLI UX =====
brew "ripgrep"
brew "fd"
brew "fzf"
brew "peco"
brew "navi"
brew "yazi"
brew "eza"
brew "bat"
brew "zoxide"
brew "starship"
brew "sheldon"
brew "zsh"
brew "neovim"

# ===== System =====
brew "f3"

# ===== Security =====
cask "1password-cli"

# ===== macOS only =====
{{ if eq .chezmoi.os "darwin" }}
brew "cocoapods"
cask "google-chrome"
cask "raycast"
cask "wezterm"
cask "karabiner-elements"
cask "docker-desktop"
cask "notion"
cask "figma"
cask "1password"
# 高速スクリーンショットツール
cask "shottr"
# 動画プレーヤー
cask "iina"
{{ end }}
